<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>

<table border="1" cellspacing="0">
    <tr>
        <?php

        echo '5.11' . '<br>';
        //Считая, что Земля — идеальная сфера с радиусом R 6350 км,
        // определить расстояние до линии горизонта от точки с высотой
        // над Землей, равной 1, 2, ...10 км.
        $r = 6350;
        $k = 10;
        $l = 0;
        for ($i = 1; $i <= $k; $i++){
            //l=sqrt{h(2R+h)}
            //Где l — расстояние до горизонта, h — высота над поверхностью и R — радиус Земли.
            $l = sqrt ($i * (2 *  $r +   $i)) ;
            echo $i . ' ' . ' - ' . $l . 'km' . '<br>';
        };
?>
<tr><th>высота</th><th>расстояние</th></tr><th>km</th></tr>


    <tr>
        <td><?php echo $i;?></td>;
        <td><?php echo $l;?></td>;
    </tr>

    </tr>
</table>
</body>
</html>

<?php
echo "<hr>" ;

echo '5.12' . '<br>';
//Плотность воздуха убывает с высотой по закону 0 hz
//p p e , где p — плотность на высоте h метров,
//0p 1,29кг/м3,4z 1, 25 10. Напечатать таблицу
//зависимости плотности от высоты для значений от 0 до 1000 м
// через каждые 100 м.
$p_0 = 1.29;
$z = 0.000125;
$h = 1000 . 'm';
for ($i = 0; $i <= $h; $i+=100){
    echo 'высота'. ' ' . $i;
    $c = -$i * $z;
    echo ' '.'значение степени' . ' =' . ' '. ($c ). '<br>';

    $p =  $p_0 * exp($c);
    echo 'плотность' . ' = ' . $p . '<br>';
    echo "<hr>" ;
}

echo "<hr>" ;

?>
<table border="1" cellspacing="0">
    <tr>
        <th>высота</th>
        <th>плотность</th>
    </tr>

    <tr>
        <td>----------</td>
        <td>----------</td>
    </tr>

    </tr>
</table>


<table border="1" cellspacing="0">
    <tr>
        <th>высота</th>
        <th>плотность</th>
    </tr>
    <?php
    for ($i = 0; $i <= $h; $i+=100) {
        $c = -$i * $z;
        $p = $p_0 * exp($c);

        echo "<tr><td>$i</td><td>$p</td></tr>";
    }
    ?>

</table>
</body>
</html>


<?php
echo "<hr>" ;


//Известно, что в массиве имеются элементы, большие 65 530. Определить:
//а) номер первого из них;
//б) номер последнего из них.
//В обеих задачах условный оператор не использовать.


//Известно, что в массиве имеются нулевые элементы. Напечатать:
//а) все элементы, кроме первого из них;
//б) все элементы, кроме последнего из них.
//Примечание
//В обеих задачах условный оператор не использовать.

//11.10. Дано натуральное число n (n 999999). Заполнить массив его цифрами,
//расположенными в обратном порядке (первый элемент равен последней
//цифре, второй — предпоследней и т. д.). Незаполненные элементы массива
//должны быть равны нулю. Элементы массива, являющиеся цифрами
//числа n, вывести на экран.
//$x = rand (1, 99999);
//$x  = (string) $x;
//echo $x. '<>br';
//$count = 0;
//for($i = 0; $i < 5; $i++) {
// $arr[] = rand(1, 9);
//  echo ' ' . $arr[$i] . ' ';
//  if ($arr[$i] >= 0){
//     $count+= $i;
// }
//}
//echo '<br>'. ' '.$count . ' '.'<br>';
//or ($i = $count; $i >= 0; $i--) {
// echo    $arr[$i] . ' ';
//while ($arr[$i] == 5) {
// echo 'номер последнего элемента  =' . ' ' . $i . ' ' . '' . '<br>';
//}
//}

//Фирме принадлежат два магазина. Известна стоимость товаров, проданных
//в каждом магазине за каждый день в июле и августе, которая хранится
//в двух массивах. Получить общую стоимость проданных фирмой товаров за
//два месяца.

//$arr = [
// 'august' => [],
//  'jule' => []
//];
//$arr_sum_1 [] = 0;
//for ($i = 1; $i <= 31; $i++) {

// $arr['august'][] = rand(100, 10000);

//  $arr_sum_1 [] = 0;
// $arr_sum_1 [] += $arr['august'[$i]];

// $arr['jule'][] = rand(100, 10000);
// var_dump('<pre>', $arr);
//}
//var_dump('<pre>', $arr);

//echo 'За июль - ' . array_sum($arr['jule']) . '<br>';
//echo 'За Август - ' . array_sum($arr['august']) . '<br>';
//var_dump('<pre>', $arr);
//echo array_sum($arr['jule']) + array_sum($arr['august']);



//В области 20 районов. Площади, засеянные пшеницей (в гектарах), и урожай, собранный в каждом районе (в центнерах),
////  хранятся в двух массивах.
////Определить среднюю урожайность пшеницы по каждому району и по области в целом.
////Задачу решить двумя способами:
////1) без использования дополнительного (третьего) массива;
////2) с использованием дополнительного массива.

$arr = [];
for ($i = 1; $i <= 20; $i++) {
    $arr[$i] = [
    ];
}
$districts = [
    1 => [
        'square' => [10, 15, 20, 25, 30],
        'harvest' => [1000, 1500, 2500, 3000],
    ],
    2 => [
        'square' => [8, 11, 14, 17, 20],
        'harvest' => [800, 1100, 1400, 1700, 2000]
    ],
    3 => [
        'square' => [1, 3, 5, 7, 9],
        'harvest' => [100, 300, 500, 700, 900]
    ],
    4 => [
        'square' => [2, 4, 6, 8, 10],
        'harvest' => [200, 400, 600, 800, 1000]
    ],
    5 => [
        'square' => [3, 6, 9, 12, 15],
        'harvest' => [300, 600, 900, 1200, 1500]
    ],
    6 => [
        'square' => [4, 7, 10, 13, 16],
        'harvest' => [400, 700, 1000, 1300, 1600]
    ],
    7 => [
        'square' => [2, 5, 6, 8, 3],
        'harvest' => [200, 500, 600, 800, 300]
    ],
    8 => [
        'square' => [1, 5, 7, 6, 2],
        'harvest' => [100, 500, 700, 600, 200]
    ],
    9 => [
        'square' => [2, 3, 5, 6, 7],
        'harvest' => [200, 300, 500, 600, 700]
    ],
    10 => [
        'square' => [11, 6, 7, 2, 10],
        'harvest' => [1100, 600, 700, 200, 1000]
    ],
    11 => [
        'square' => [1, 3, 6, 8, 9],
        'harvest' => [100, 300, 600, 800, 900]
    ],
    12 => [
        'square' => [9, 8, 7, 6, 5],
        'harvest' => [900, 800, 700, 600, 500]
    ],
    13 => ['square' => [1, 5, 9, 3, 5],
        'harvest' => [100, 500, 900, 300, 500]
    ],
    14 => [
        'square' => [2, 5, 8, 6, 3],
        'harvest' => [200, 500, 800, 600, 300]
    ],
    15 => [
        'square' => [1, 4, 7, 2, 6],
        'harvest' => [100, 400, 700, 200, 600]
    ],
    16 => ['square' => [3, 6, 9, 8, 7],
        'harvest' => [300, 600, 900, 800, 700]
    ],
    17 => ['square' => [8, 7, 9, 6, 3],
        'harvest' => [800, 700, 900, 600, 300]
    ],
    18 => ['square' => [4, 5, 6, 1, 2],
        'harvest' => [400, 500, 600, 100, 200]
    ],
    19 => [
        'square' => [3, 2, 1, 4, 5],
        'harvest' => [300, 200, 100, 400, 500]
    ],
    20 => [
        'square' => [5, 2, 3, 1, 4],
        'harvest' => [500, 200, 300, 100, 400],
    ],
];
//$totalSq = 0;
//$totalH = 0;
//foreach ($districts as $key => $item) {

// $sum_square = array_sum($item['square']);
//$sum_harvest = array_sum($item['harvest']);
// без 3-го
//$totalSq += $sum_square;
// $totalH += $sum_harvest;
//  echo '<br>' . 'Средний урожай по району  ' . $key . ' - ' . $sum_harvest / $sum_square . '<br>';

// $districts[$key]['total']['avc_square'] = $sum_harvest / $sum_square;
//$districts[$key]['total']['sum_square'] = $sum_square;
//$districts[$key]['total']['sum_harvest'] = $sum_harvest;
//}
echo "<hr>";
echo '<hr>';
//echo 'Средний урожай по области = ' . $totalSq / $totalH . '<br>';
echo "<hr>";
$totalSq = 0;
$totalH = 0;

foreach ($districts as $key => $district) {
    $sum_square = array_sum($item['square']);
    //$sum_harvest = array_sum($item['harvest']);
    $totalSq += $sum_square;
    $totalH += $sum_harvest;
    $totalSq += $district['total']['sum_square'];
    $totalH += $district['total']['sum_harvest'];

    echo 'Средний урожай по району ' . $key . ' - ' . $district['total']['avc_square'] . '<br>';
}

echo 'Средний урожай по области =' . ' ' . $totalSq / $totalH . '<br>';

